app/views/staff/loanorders/_search_form.html.erb

SELECT DISTINCT `loanorders`.`company_code`, `loanorders`.`company_name` FROM `loanorders`
---

	<%= f.collection_select :company_code, Loanorder.select(:company_code, :company_name).uniq, :company_code, :company_name,include_blank: true %>