app/controllers/customer/loanorders_controller.rb

	def index
		@max = Loanorder.maximum(:update_datetime)
		@customer = Customer.where(company_id: session[:company_code])
		@company_code = session[ :company_code]
		#2015/10/24 店舗での絞り込みをもらしていた
		#ActiveModelに店舗コードを渡すため、search_formの引数を追加
		@store_code   = session[ :store_code].to_s
		if session[:parent_and_child] == '親'  then
			@search_form = Customer::LoanorderSearchForm.new(params[:search])
			@loanorders = @search_form.search(session[ :company_code],session[ :store_code],'1').page(params[:page]).per(14)
---
SELECT MAX(`loanorders`.`update_datetime`) AS max_id FROM `loanorders`
SELECT `customers`.* FROM `customers`  WHERE `customers`.`company_id` = 2009 AND (`customers`.`store_code` NOT IN (0))  ORDER BY `customers`.`store_code` ASC