app/controllers/customer/sessions_controller.rb

	def create
    @login_form = Customer::LoginForm.new(params[:customer_login_form])
    if @login_form.valid?
	    if @login_form.email.present?
	      customer = Customer.find_by(email_for_index: @login_form.email.downcase)
	    end
	    if Customer::Authenticator.new(customer).authenticate(@login_form.password)
	    	if customer.suspended?
	    		flash.now.alert = 'アカウントが停止されています。'
	    		render action: 'new'
	    	else
	    		company = Company.where(company_code: customer.company_id).first
---
SELECT  `customers`.* FROM `customers`  WHERE `customers`.`email_for_index` = 'michu@yahoo.co.jp' LIMIT 1
SELECT  `companies`.* FROM `companies`  WHERE `companies`.`company_code` = 2009  ORDER BY `companies`.`id` ASC LIMIT 1