app/controllers/admin/companies_controller.rb

  def index
    @companies = Company.order(:company_code)
    @companies = @companies.page(params[:page])
---
SELECT COUNT(*) FROM `companies`
SELECT  `companies`.* FROM `companies`   ORDER BY `companies`.`company_code` ASC LIMIT 15 OFFSET 0