app/controllers/admin/customers_controller.rb

SELECT COUNT(*) FROM `customers` INNER JOIN companies ON customers.company_id = companies.company_code
SELECT  customers.*,companies.company_code,companies.company_name FROM `customers` INNER JOIN companies ON customers.company_id = companies.company_code  ORDER BY companies.company_code, `customers`.`store_code` ASC, `customers`.`parent_and_child` ASC LIMIT 15 OFFSET 0
---
 	def index
    #@company = Company.all
    @customer = Customer.joins('INNER JOIN companies ON customers.company_id = companies.company_code')
                        .select('customers.*,companies.company_code,companies.company_name')
                        .order('companies.company_code', :store_code, :parent_and_child)
    #@customer = Customer.all
    @customer = @customer.page(params[:page])

SELECT  customers.*,companies.company_name FROM `customers` INNER JOIN companies ON customers.company_id = companies.company_code WHERE `customers`.`id` = 44 LIMIT 1
---
  def print
    #2015/10/15 加盟店名、店舗名を追加
    #@customer = Customer.find(params[:id])
    @customer = Customer.joins('INNER JOIN companies ON customers.company_id = companies.company_code')
                        .select('customers.*,companies.company_name')

    @customer = @customer.find(params[:id])

SELECT  `customers`.* FROM `customers`  WHERE `customers`.`id` = 44 LIMIT 1
---
  def edit
  	@customer = Customer.find(params[:id])

SELECT  `customers`.* FROM `customers`  WHERE `customers`.`id` = 44 LIMIT 1
UPDATE `customers` SET `start_date` = '2015-10-16', `updated_at` = '2015-11-27 15:29:01' WHERE `customers`.`id` = 18
---
  def update
    @customer = Customer.find(params[:id])
    @customer.assign_attributes(customer_params)
    #if @customer.valid?
	    if @customer.save