app/controllers/admin/loanorders_controller.rb

SELECT MAX(`loanorders`.`update_datetime`) AS max_id FROM `loanorders`
SELECT COUNT(*) FROM `loanorders`
SELECT DISTINCT `loanorders`.`company_code`, `loanorders`.`company_name` FROM `loanorders`
---
	def index
		#@search_form = Admin::LoanorderSearchForm.new
		@max = Loanorder.maximum(:update_datetime)
  	@loan = Loanorder.select(:company_code,:company_name).uniq

INSERT INTO `import_logs` (`created_at`, `email`, `import_datetime`, `import_filename`, `updated_at`) VALUES ('2015-11-27 17:54:04', 'juri-iwanaga@jcs-finance.co.jp', '2015-11-27 17:54:04', 'filename', '2015-11-27 17:54:04')
---
  def import
  # fileはtmpに自動で一時保存される
	  if params[:file].blank?
			redirect_to admin_loanorders_url, notice: "ファイルを選択してください。"
		else
			file_name = params[:file].original_filename
	  	Loanorder.import(params[:file])
	  	ImportLog.create!(email: session[:email], import_datetime: DateTime.now, import_filename: file_name)