app/controllers/admin/sessions_controller.rb

SELECT  `administrators`.* FROM `administrators`  WHERE `administrators`.`email_for_index` = 'juri-iwanaga@jcs-finance.co.jp' LIMIT 1
---
	def create
    @login_form = Admin::LoginForm.new(params[:admin_login_form])
    if @login_form.valid?
	    if @login_form.email.present?
	      administrator = Administrator.find_by(email_for_index: @login_form.email.downcase)