app/controllers/admin/staff_members_controller.rb

SELECT  `staff_members`.* FROM `staff_members`   ORDER BY `staff_members`.`family_name_kana` ASC, `staff_members`.`given_name_kana` ASC LIMIT 12 OFFSET 0
SELECT COUNT(*) FROM `staff_members`
---
  def index
    @staff_members = StaffMember.order(:family_name_kana, :given_name_kana)
    @staff_members = @staff_members.page(params[:page]).per(12)

SELECT  `staff_members`.* FROM `staff_members`  WHERE `staff_members`.`id` = 25 LIMIT 1
---
  def edit
    @staff_member = StaffMember.find(params[:id])

SELECT  `staff_members`.* FROM `staff_members`  WHERE `staff_members`.`id` = 25 LIMIT 1
UPDATE `staff_members` SET `password_digest` = '$2a$10$roZsq6dh4i9yt6GzequM/e..i9GEg6kvoBIPfH5NmJGQhlh8adzgC', `updated_at` = '2015-11-27 23:37:04' WHERE `staff_members`.`id` = 25
---
  def update
    @staff_member = StaffMember.find(params[:id])
    @staff_member.assign_attributes(staff_member_params)
    if @staff_member.valid?
	    if @staff_member.save