app/views/admin/customers/_form.html.erb

  m << p.notes
  m << p.collection_select_block(:company_id,'加盟店',Company.order(:company_code),:company_code,:company_name,required: true)
---
SELECT `companies`.* FROM `companies`   ORDER BY `companies`.`company_code` ASC