app/controllers/staff/import_logs_controller.rb

		def index
		@logs = ImportLog.all
		@logs = @logs.order(import_datetime: :desc).page(params[:page]).per(30)
---
SELECT  `import_logs`.* FROM `import_logs`   ORDER BY `import_logs`.`import_datetime` DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM `import_logs`