app/controllers/staff/sessions_controller.rb

SELECT  `staff_members`.* FROM `staff_members`  WHERE `staff_members`.`email_for_index` = 'masa-postman@ailuck.co.jp' LIMIT 1
---
	def create
    @login_form = Staff::LoginForm.new(params[:staff_login_form])
    if @login_form.valid?
	    if @login_form.email.present?
	      staff_member = StaffMember.find_by(email_for_index: @login_form.email.downcase)